In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Al", "Bhosdu", "Babblu"], 
    "last": ["Singh", "Lullu", "Capone"],
    "email": ["as@gmal.com", "bl@email.com", "bs@email.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first    last         email
0      Al   Singh   as@gmal.com
1  Bhosdu   Lullu  bl@email.com
2  Babblu  Capone  bs@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ["first_name", "last_name", "email_id"]

In [7]:
df

  first_name last_name      email_id
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com

In [8]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME      EMAIL_ID
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com

In [9]:
df.columns = df.columns.str.replace("_","-")
df

  FIRST-NAME LAST-NAME      EMAIL-ID
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com

In [10]:
df.columns = [x.lower() for x in df.columns]
df.columns = df.columns.str.replace("-", "_")
df

  first_name last_name      email_id
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com

ONLY CHANGE SOME COLUMNS?

In [11]:
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)

In [12]:
df

    first    last      email_id
0      Al   Singh   as@gmal.com
1  Bhosdu   Lullu  bl@email.com
2  Babblu  Capone  bs@email.com

In [15]:
df.loc[2, ["last", "email_id"]] = ["Bhosda", "hello123@org.edu"]

In [16]:
df

    first    last          email_id
0      Al   Singh       as@gmal.com
1  Bhosdu   Lullu      bl@email.com
2  Babblu  Bhosda  hello123@org.edu

In [18]:
df.rename(columns={"email_id": "email"}, inplace=True)
df

    first    last             email
0      Al   Singh       as@gmal.com
1  Bhosdu   Lullu      bl@email.com
2  Babblu  Bhosda  hello123@org.edu

In [19]:
df["email"] = df["email"].str.upper()

In [20]:
df

    first    last             email
0      Al   Singh       AS@GMAL.COM
1  Bhosdu   Lullu      BL@EMAIL.COM
2  Babblu  Bhosda  HELLO123@ORG.EDU

In [21]:
df["email"] = df["email"].str.lower()

In [22]:
df

    first    last             email
0      Al   Singh       as@gmal.com
1  Bhosdu   Lullu      bl@email.com
2  Babblu  Bhosda  hello123@org.edu

CHANGING MULTIPLE ROWS - MORE ADVANCED CHANGES

In [25]:
# apply - used for calling a function on our values
# map
# applymap
# replace

In [26]:
df["email"].apply(len)

0    11
1    12
2    16
Name: email, dtype: int64

In [27]:
def update_email(email):
    return email.upper()

In [28]:
df["email"].apply(update_email)

0         AS@GMAL.COM
1        BL@EMAIL.COM
2    HELLO123@ORG.EDU
Name: email, dtype: object

In [29]:
df

    first    last             email
0      Al   Singh       as@gmal.com
1  Bhosdu   Lullu      bl@email.com
2  Babblu  Bhosda  hello123@org.edu

In [31]:
df["email"] = df["email"].apply(update_email)

In [32]:
df

    first    last             email
0      Al   Singh       AS@GMAL.COM
1  Bhosdu   Lullu      BL@EMAIL.COM
2  Babblu  Bhosda  HELLO123@ORG.EDU

In [33]:
df["email"] = df["email"].apply(lambda x: x.lower())

In [34]:
df

    first    last             email
0      Al   Singh       as@gmal.com
1  Bhosdu   Lullu      bl@email.com
2  Babblu  Bhosda  hello123@org.edu